## CAPÍTULO 3

### Ajuste avanzado de STP

Este capítulo cubre los siguientes temas:

- **Ajuste de la topología STP**: esta sección explica algunas de las opciones para **modificar la ubicación del root bridge** o **mover puertos en bloqueo a puertos designados**.
    
- **Mecanismos adicionales de protección STP**: esta sección describe **mecanismos de protección** como **Root Guard**, **BPDU Guard** y **STP Loop Guard**.
    

Este capítulo revisa **técnicas para configurar un switch** de manera que esté **garantizado como root bridge** o como **root bridge de respaldo** en una topología de **Capa 2**. Además, explica **funciones que evitan que otros switches tomen el control del root bridge de forma involuntaria**.  
También se describen otras **características comunes** utilizadas en las **guías de diseño validadas para campus empresariales de Cisco**.

---
### Ajuste de la topología STP

Una **red correctamente diseñada** coloca estratégicamente el **root bridge** en un **switch específico** y define qué puertos deben ser **puertos designados** (es decir, en **estado forwarding**) y cuáles deben ser **puertos alternos** (en **estado discarding/bloqueo**).

Las **consideraciones de diseño** incluyen la **plataforma de hardware**, la **resiliencia**, y la **topología de red**. Este capítulo utiliza la **misma topología de referencia** del **Capítulo 2, “Spanning Tree Protocol”**, como se muestra en la **Figura 3-1**.

![3-1](img/20260102071023.png)

### Ubicación del root bridge

Idealmente, el **root bridge** se coloca en **un solo switch**, y se designa un **root bridge secundario** para **minimizar cambios** en el árbol de expansión global. La colocación del root bridge se logra **reduciendo la prioridad del sistema** en el root bridge al **valor más bajo posible**, **aumentando ligeramente** la prioridad del root bridge secundario por encima de la del root bridge y, de forma ideal, **incrementando la prioridad del sistema en todos los demás switches**. Este enfoque **garantiza una colocación consistente** del root bridge.

La **prioridad** se configura con **uno de los siguientes comandos**:

- **`spanning-tree vlan vlan-id priority priority`**: la prioridad es un valor entre **0 y 61,440**, en **incrementos de 4096**.
    
- **`spanning-tree vlan vlan-id root {primary | secondary} [diameter diameter]`**: este comando ejecuta un **script** que establece la prioridad de forma automática y, opcionalmente, ajusta temporizadores si se usa la palabra clave **`diameter`**.
    
    - **primary** configura la prioridad en **24,576**.
        
    - **secondary** configura la prioridad en **28,672**.
        

> **Nota:** Si otro switch tiene una prioridad de **24,576 (o menor)** y resulta más preferido cuando se ejecuta el comando **`spanning-tree vlan vlan-id root {primary | secondary}`**, el script **reduce automáticamente la prioridad** en un intento de convertir a ese switch en el **root bridge**.

La palabra clave opcional **`diameter`** permite **ajustar la convergencia de STP** y **modificar temporizadores**; debe reflejar el **número máximo de saltos de Capa 2** entre un switch y el root bridge. No es necesario modificar los temporizadores en otros switches, ya que estos se **propagan por toda la topología** mediante las **BPDUs del root bridge**.

**Ejemplo 3-1:** Cambio de la prioridad del sistema STP en SW1

El **Ejemplo 3-1** verifica la **prioridad inicial** de **VLAN 1** en **SW1** y luego comprueba cómo se realiza el cambio. Posteriormente, la prioridad se **verifica nuevamente** para asegurar que el valor haya sido **reducido** correctamente.
#### Verificación de la prioridad de STP en SW1 antes del cambio

```plaintext
SW1# show spanning-tree vlan 1

VLAN0001
  Spanning tree enabled protocol rstp

  Root ID    Priority    32769
             Address     0062.ec9d.c500
             This bridge is the root
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec

  Bridge ID  Priority    32769 (priority 32768 sys-id-ext 1)
             Address     0062.ec9d.c500
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec
             Aging Time  300 sec
```
#### Configuración de la prioridad de SW1 como root primario para VLAN 1

```plaintext
SW1(config)# spanning-tree vlan 1 root primary
```
#### Verificación de la prioridad de STP en SW1 después del cambio

```plaintext
SW1# show spanning-tree vlan 1

VLAN0001
  Spanning tree enabled protocol rstp

  Root ID    Priority    24577
             Address     0062.ec9d.c500
             This bridge is the root
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec

  Bridge ID  Priority    24577 (priority 24576 sys-id-ext 1)
             Address     0062.ec9d.c500
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec
             Aging Time  300 sec

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/2          Desg FWD 4     128.2    P2p
Gi1/0/3          Desg FWD 4     128.3    P2p
Gi1/0/14         Desg FWD 4     128.14   P2p
```

---

El **Ejemplo 3-2** verifica la prioridad de **VLAN 1** en **SW2** antes de cambiarla para que actúe como **root bridge de respaldo** en caso de una falla de **SW1**. Obsérvese que la prioridad del root bridge ahora es **24,577**, y la prioridad del switch local se encuentra inicialmente en **32,769** (valor predeterminado).  
Luego se ejecuta el comando **`spanning-tree vlan 1 root secondary`** para modificar la prioridad de **SW2**, configurándola en **28,673**.

Aquí STP deja de ser pasivo y se vuelve **ingeniería consciente**: no esperas a que la MAC “gane”, decides quién manda… y quién está listo para tomar el mando si algo falla.

**Ejemplo 3-2:** Cambio de la prioridad del sistema STP en SW2

Este ejemplo muestra cómo **SW2** se configura como **root bridge secundario** para **VLAN 1**, verificando la prioridad **antes y después** del cambio.
#### Verificación de la prioridad de STP en SW2 antes del cambio

```plaintext
SW2# show spanning-tree vlan 1
Output omitted for brevity

VLAN0001
  Spanning tree enabled protocol rstp

  Root ID    Priority    24577
             Address     0062.ec9d.c500
             Cost        4
             Port        1 (GigabitEthernet1/0/1)
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec

  Bridge ID  Priority    32769 (priority 32768 sys-id-ext 1)
             Address     0081.c4ff.8b00
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec
             Aging Time  300 sec

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/1          Root FWD 4     128.1    P2p
Gi1/0/3          Desg FWD 4     128.3    P2p
Gi1/0/4          Desg FWD 4     128.4    P2p
```
#### Configuración de SW2 como root bridge secundario para VLAN 1

```plaintext
SW2(config)# spanning-tree vlan 1 root secondary
```
#### Verificación de la prioridad de STP en SW2 después del cambio

```plaintext
SW2# show spanning-tree vlan 1

VLAN0001
  Spanning tree enabled protocol rstp

  Root ID    Priority    24577
             Address     0062.ec9d.c500
             Cost        4
             Port        1 (GigabitEthernet1/0/1)
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec

  Bridge ID  Priority    28673 (priority 28672 sys-id-ext 1)
             Address     0081.c4ff.8b00
             Hello Time  2 sec   Max Age 20 sec   Forward Delay 15 sec
             Aging Time  300 sec

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/1          Root FWD 4     128.1    P2p
Gi1/0/3          Desg FWD 4     128.3    P2p
Gi1/0/4          Desg FWD 4     128.4    P2p
```

**Clave conceptual:**

- **SW1** queda como **root primario** con prioridad **24,577**.
    
- **SW2** se establece como **root secundario** con prioridad **28,673**, listo para asumir el rol si **SW1** falla.
    

Esto es STP bien afinado: **decisión explícita** sobre quién manda y **plan B** preparado antes de que el problema exista.

La **ubicación del root bridge** es una **decisión importante** y, a menudo, debe elegirse para **minimizar el número de saltos** hasta el switch más alejado en la topología. El diseño debe considerar **dónde existen conexiones redundantes**, **qué conexiones serán bloqueadas** y la **capacidad (rendimiento)** del root switch para manejar **tráfico entre switches**. En general, los **root switches** se sitúan en **límites de Capa 2 / Capa 3**.

La **mejor manera de evitar** que dispositivos no deseados asuman el rol de **root STP** es **configurar la prioridad en 0** para el **root primario** y en **4096** para el **root secundario**. Además, debe utilizarse **Root Guard** (como se explica más adelante en este capítulo).
### Modificación de la ubicación del puerto raíz STP y de los puertos bloqueados

El **costo del puerto STP** se utiliza para **calcular el árbol STP**. Cuando un switch **genera BPDUs**, el **costo del camino a la raíz (root path cost)** incluye **solo la métrica calculada hasta la raíz** y **no incluye** el costo del puerto por el cual se anuncia la BPDU. El **switch receptor** **suma el costo del puerto de entrada** al valor del root path cost contenido en la BPDU.

En la **Figura 3-2**, **SW1** anuncia sus BPDUs a **SW3** con un **root path cost de 0**. **SW3** recibe la BPDU y **agrega su costo de puerto STP de 4** al root path cost de la BPDU, resultando en un valor de **4**. Luego **SW3** anuncia la BPDU hacia **SW5** con un **root path cost de 4**, que **SW5** recibe y **agrega su costo de puerto STP de 4**. Por lo tanto, **SW5** reporta un **root path cost de 8** para alcanzar el **root bridge vía SW3**.

![3-2](img/20260102071636.png)

La lógica se confirma en la salida del **Ejemplo 3-3**. Observa que **no aparece un “root path cost”** en la salida de **SW1**.

**Ejemplo 3-3:** Verificación del costo total del camino
```plaintext
SW1# show spanning-tree vlan 1
Output omitted for brevity

VLAN0001
  Root ID    Priority    32769
             Address     0062.ec9d.c500
             This bridge is the root

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/2          Desg FWD 4     128.2    P2p
Gi1/0/3          Desg FWD 4     128.3    P2p
```

```plaintext
SW3# show spanning-tree vlan 1
Output omitted for brevity

VLAN0001
  Root ID    Priority    32769
             Address     0062.ec9d.c500
             Cost        4
             Port        1 (GigabitEthernet1/0/1)

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/1          Root FWD 4     128.1    P2p
Gi1/0/2          Altn BLK 4     128.2    P2p
Gi1/0/5          Desg FWD 4     128.5    P2p
```

```plaintext
SW5# show spanning-tree vlan 1
Output omitted for brevity

VLAN0001
  Root ID    Priority    32769
             Address     0062.ec9d.c500
             Cost        8
             Port        3 (GigabitEthernet1/0/3)

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/3          Root FWD 4     128.3    P2p
Gi1/0/4          Altn BLK 4     128.4    P2p
Gi1/0/5          Altn BLK 4     128.5    P2p
```

**Clave de lectura:**

- En **SW1** (root bridge) **no aparece el root path cost** porque **siempre es 0** en la raíz.
    
- En **SW3**, el **costo total** hacia la raíz es **4** (un enlace de 1 Gbps).
    
- En **SW5**, el **costo total** es **8** (dos enlaces de 1 Gbps).
    

STP suma **costos de puertos en recepción**, no en anuncio. El resultado es determinista y explica exactamente por qué cada switch ve el costo que ve.

Al **cambiar el costo de puerto STP** con el comando **`spanning-tree [vlan vlan-id] cost cost`**, puedes **modificar el camino de reenvío** de STP.

- Puedes **reducir el costo** de un camino que actualmente es **alterno** para convertirlo en **designado**.
    
- O **aumentar el costo** de un puerto **designado** para que pase a **bloqueo**.
    

El comando **`spanning-tree cost`** **modifica el costo para todas las VLANs** a menos que se use la **palabra clave opcional** para **especificar una VLAN**.

El **Ejemplo 3-4** demuestra la modificación del **costo STP** de **SW3 Gi1/0/1** a **1**, lo que impacta la **selección de puertos** entre **SW2 y SW3**.

- **SW2** recibe una BPDU de **SW3** con **costo 1**.
    
- **SW3** recibe una BPDU de **SW2** con **costo 5**.  
    Como resultado, **SW3 Gi1/0/2** **deja de ser alterno** y pasa a ser **puerto designado**. El puerto **SW2 Gi1/0/3** cambia de **designado** a **alterno**.
    

**Ejemplo 3-4:** Modificación del costo de puerto STP
```plaintext
SW3# conf t
SW3(config)# interface gi1/0/1
SW3(config-if)# spanning-tree cost 1
```

```plaintext
SW3# show spanning-tree vlan 1
Output omitted for brevity

VLAN0001
  Root ID    Priority    32769
             Address     0062.ec9d.c500
             Cost        1
             Port        1 (GigabitEthernet1/0/1)

  Bridge ID  Priority    32769 (priority 32768 sys-id-ext 1)
             Address     189c.5d11.9980

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/1          Root FWD 1     128.1    P2p
Gi1/0/2          Desg FWD 4     128.2    P2p
Gi1/0/5          Desg FWD 4     128.5    P2p
```

```plaintext
SW2# show spanning-tree vlan 1
Output omitted for brevity

VLAN0001
  Root ID    Priority    32769
             Address     0062.ec9d.c500
             Cost        4
             Port        1 (GigabitEthernet1/0/1)

  Bridge ID  Priority    32769 (priority 32768 sys-id-ext 1)
             Address     0081.c4ff.8b00
```

**Lectura clave:** STP no es estático; **pequeños ajustes de costo** pueden **redirigir el tráfico** y **cambiar roles de puertos** de forma determinista. Es bisturí, no martillo.
### Modificación de la prioridad de puerto STP

La **prioridad de puerto STP** influye en **qué puerto se selecciona como alterno** cuando existen **múltiples enlaces** entre switches. En nuestra topología de prueba, **deshabilitar un enlace** entre **SW3 y SW5** obliga a **SW5** a **elegir uno de los enlaces** conectados a **SW4** como **puerto raíz (RP)**.

El **Ejemplo 3-5** verifica que este cambio convierte a **SW5 Gi1/0/4** en el **puerto raíz (RP)** hacia **SW4**.  
Recuerda que **el System ID y el costo de puerto son iguales**, por lo que el **siguiente criterio de selección** es la **prioridad de puerto**, seguida por el **número de puerto**. Tanto la **prioridad** como el **número de puerto** están **controlados por el switch aguas arriba**, ya que está **más cerca del root bridge**.

**Ejemplo 3-5:** Visualización de la prioridad de puerto STP
```plaintext
SW5# show spanning-tree vlan 1
Output omitted for brevity

VLAN0001
Spanning tree enabled protocol rstp

Root ID    Priority    32769
           Address     0062.ec9d.c500
           Cost        12
           Port        4 (GigabitEthernet1/0/4)

Bridge ID  Priority    32769 (priority 32768 sys-id-ext 1)
           Address     bc67.1c5c.9300

Interface        Role Sts Cost  Prio.Nbr Type
---------------- ---- --- ----- -------- ----
Gi1/0/4          Root FWD 4     128.4    P2p
Gi1/0/5          Altn BLK 4     128.5    P2p

Interfaz        Rol   Estado  Costo  Prio.Nbr  Tipo
---------------------------------------------------
Gi1/0/1         Root  FWD     4      128.1     P2p
Gi1/0/3         Altn  BLK     4      128.3     P2p
Gi1/0/4         Desg  FWD     4      128.4     P2p

```

Puedes **modificar la prioridad de puerto** en **SW4 Gi1/0/6** (hacia **SW5 Gi1/0/5**) con el comando **`spanning-tree [vlan vlan-id] port-priority priority`**.  
La **palabra clave opcional `vlan`** permite **cambiar la prioridad por VLAN**. El **Ejemplo 3-6** muestra cómo **cambiar la prioridad de puerto en SW4 Gi1/0/6 a 64**.

**Ejemplo 3-6:** Verificación del impacto de la prioridad de puerto STP en la topología
```plaintext
SW4# configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
SW4(config)# interface gi1/0/6
SW4(config-if)# spanning-tree port-priority 64
```

**Idea clave:** cuando los costos empatan, **la prioridad de puerto decide**. Ajustarla es una forma precisa de **guiar la elección de RPs y puertos alternos** sin tocar enlaces físicos.

Aquí tienes la **traducción fiel al español** con la **lectura técnica correcta** del fragmento:

Ahora, **Gi1/0/6 de SW4** tiene un valor de **64**, que es **menor** que el valor del puerto **Gi1/0/5**, el cual usa el **valor por defecto 128**.  
Debido a esto, **la interfaz Gi1/0/6 de SW4 pasa a ser la preferida** y **cambia el puerto raíz (RP) en SW5**, como se muestra en el **Ejemplo 3-7**.

**Ejemplo 3-7:** Determinación del impacto de la prioridad de puerto en la topología

**Salida en SW4**

```plaintext
SW4# show spanning-tree vlan 1
Output omitted for brevity

Interface        Role Sts Cost  Prio.Nbr Type
--------------------------------------------
Gi1/0/2          Root FWD 4     128.2    P2p
Gi1/0/5          Desg FWD 4     128.5    P2p
Gi1/0/6          Desg FWD 4     64.6     P2p
```

**Salida en SW5**

```plaintext
SW5# show spanning-tree vlan 1
Output omitted for brevity

Interface        Role Sts Cost  Prio.Nbr Type
--------------------------------------------
Gi1/0/4          Altn BLK 4     128.4    P2p
Gi1/0/5          Root FWD 4     128.5    P2p
```
### Lectura técnica (sin magia, solo STP):

- Todos los enlaces tienen **el mismo costo (4)**
    
- STP desempata usando **prioridad de puerto**
    
- **64 < 128**, así que **Gi1/0/6 gana**
    
- SW5 ahora selecciona **Gi1/0/5 como Root Port**, porque recibe BPDUs desde el puerto con **menor prioridad aguas arriba**
    

Resultado:  
Un **simple ajuste de prioridad**, sin tocar enlaces físicos, **redefine la topología activa**.  
Esto es **STP tuning quirúrgico**, no fuerza bruta.
### Mecanismos adicionales de protección STP (introducción)

Los paquetes de red **no decrementan TTL en Capa 2**, por lo que los bucles de forwarding son especialmente destructivos. Cuando ocurre un bucle de Capa 2:

- El tráfico broadcast y multicast se replica indefinidamente
    
- El uso de CPU se dispara
    
- La memoria se agota
    
- El rendimiento cae de forma visible
    
- El switch puede llegar a colapsar
    

Escenarios típicos que provocan bucles de Capa 2:

- STP deshabilitado en un switch
    
- Balanceadores mal configurados enviando tráfico por múltiples puertos con la misma MAC
    
- Switches virtuales que puentean interfaces físicas sin participar en STP
    
- Usuarios finales conectando hubs o switches no gestionados
    

Los **switches Catalyst** detectan cuando una **dirección MAC está “flapping”** (cambiando repetidamente entre interfaces) y **notifican el evento vía syslog**, incluyendo:

- la **dirección MAC del host**,
    
- la **VLAN**,
    
- y los **puertos** entre los cuales la MAC está oscilando.
    

Estos mensajes **deben investigarse**, ya que normalmente indican la posible existencia de un **bucle de forwarding en Capa 2**.

Cuando **STP ha sido eliminado de la topología**, este tipo de flapping es especialmente peligroso. El **Ejemplo 3-8** muestra un **mensaje syslog típico** generado por una **MAC flapping** en un escenario donde **STP no está presente**.

**Lectura de fondo (modo operador con café fuerte):**  
Una MAC que flapea no es un “warning simpático”, es el **canario en la mina**. Significa que el switch está viendo **el mismo host aparecer por múltiples puertos**, lo cual casi siempre apunta a:

- un **loop de Capa 2**,
    
- un **bridge mal configurado**,
    
- o alguien conectando hardware creativo donde no debía.
    

STP evita el incendio.  
Los syslogs te avisan cuando ya huele a humo.

**Ejemplo 3-8:** Mensaje syslog por una dirección MAC en _flapping_
```plaintext
12:40:30.044: %SW_MATM-4-MACFLAP_NOTIF:
Host 70df.2f22.b8c7 in vlan 1 is flapping
between port Gi1/0/3 and port Gi1/0/2
```

El switch detectó que el **host con MAC 70df.2f22.b8c7**, en la **VLAN 1**, está **cambiando repetidamente** entre los **puertos Gi1/0/3 y Gi1/0/2**.

En este escenario, se debe **verificar STP en todos los switches** que transportan la **VLAN indicada** en el mensaje syslog, para asegurarse de que **Spanning Tree esté habilitado y funcionando correctamente**.
## Root Guard

**Root Guard** es una función de STP que se **habilita por puerto** y **evita que un puerto configurado se convierta en root port**.

- Impide que **switches aguas abajo** (a menudo mal configurados o no confiables) **se conviertan en root bridge**.
    
- Funciona colocando el puerto en un **estado inconsistente de root** cuando recibe una **BPDU superior**.
    
- Mientras esté en ese estado, el puerto **no reenvía tráfico**.
    
- Así se evita que un **puerto designado (DP)** con Root Guard termine siendo **root port (RP)**.
    

**Configuración:**  
Se habilita con:

```plaintext
spanning-tree guard root
```

**Buenas prácticas:**

- Root Guard debe aplicarse en **puertos designados hacia otros switches** que **nunca deberían ser root bridges**.
    
- En la topología de ejemplo, Root Guard debería colocarse:
    
    - En **SW2 Gi1/0/4** hacia **SW4**
        
    - En **SW3 Gi1/0/5** hacia **SW5**
        

Esto evita que **SW4 o SW5** se conviertan en root bridge y mantiene la topología bajo control.
## STP PortFast

Generar **TCN (Topology Change Notification)** por hosts **no tiene sentido**, ya que un host normalmente tiene **una sola conexión**.  
**STP PortFast** evita la generación de TCN en **puertos de acceso**.

### Beneficios de PortFast:

- **Deshabilita TCN** en puertos de acceso.
    
- El puerto pasa **directamente a forwarding**, sin estados:
    
    - listening
        
    - learning
        
- Ideal para **PCs, impresoras, teléfonos IP, servidores**, etc.
    

### Interacción con BPDU:

- Si se recibe una **BPDU en un puerto PortFast**,  
    → **PortFast se desactiva automáticamente**  
    → El puerto vuelve al comportamiento normal de STP.
    

### Configuración:

**Por puerto:**

```plaintext
spanning-tree portfast
```

**Global (todos los puertos de acceso):**

```plaintext
spanning-tree portfast default
```

**Deshabilitar en un puerto específico cuando PortFast está globalmente activo:**

```plaintext
spanning-tree portfast disable
```

**En enlaces trunk (caso muy específico):**

```plaintext
spanning-tree portfast trunk
```

⚠️ **Usar solo cuando el puerto conecta a un único host**, por ejemplo:

- un servidor con **hipervisor**
    
- múltiples VLANs
    
- **una sola NIC**
    

> Habilitar **PortFast** cambia el **tipo de puerto RSTP a Edge Port**.

El **Ejemplo 3-9** muestra cómo habilitar **PortFast** para el puerto **SW1 Gi1/0/13**. Luego, la configuración se verifica examinando **STP para la VLAN 10** o examinando la **interfaz STP**. Observa que los **puertos PortFast se muestran con el tipo P2P Edge**. La última sección de la salida demuestra cómo **PortFast se habilita globalmente** para todos los puertos de acceso.

**Ejemplo 3-9: Habilitación de STP PortFast en interfaces específicas**

```plaintext
SW1(config)# interface gigabitEthernet1/0/13
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 10
SW1(config-if)# spanning-tree portfast
```

```plaintext
SW1# show spanning-tree vlan 10
Output omitted for brevity

VLAN0010
Interface        Role Sts Cost  Prio.Nbr Type
--------------------------------------------
Gi1/0/2          Desg FWD 4     128.2    P2p
Gi1/0/3          Desg FWD 4     128.3    P2p
Gi1/0/13         Desg FWD 4     128.13   P2p Edge
```

```plaintext
SW1# show spanning-tree interface gi1/0/13 detail
Port 13 (GigabitEthernet1/0/13) of VLAN0010 is designated forwarding
Port path cost 4, Port priority 128, Port Identifier 128.13
Designated root has priority 32778, address 0062.ec9d.c500
Designated bridge has priority 32778, address 0062.ec9d.c500
Designated port id is 128.13, designated path cost 0
Timers: message age 0, forward delay 0, hold 0
Number of transitions to forwarding state: 1
The port is in the portfast mode
Link type is point-to-point by default
BPDU: sent 23103, received 0
```

El **Ejemplo 3-10** muestra cómo habilitar **PortFast globalmente** para todos los **puertos de acceso** en **SW2** y luego **deshabilitarlo** para **Gi1/0/8**.

**Ejemplo 3-10: Habilitación global de STP PortFast**

```plaintext
SW2# configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
SW2(config)# spanning-tree portfast default
%Warning: this command enables portfast by default on all interfaces.
You should now disable portfast explicitly on switch ports leading to hubs,
switches and bridges as they may create temporary bridging loops.
SW2(config)# interface gi1/0/8
SW2(config-if)# spanning-tree portfast disable
```

**BPDU Guard**

**BPDU Guard** es un mecanismo de seguridad que coloca los puertos configurados con **STP PortFast** en estado **errDisable** al recibir una **BPDU**. Mientras un puerto está en estado errDisable, **no procesa ningún tráfico de red**. Asumiendo que todos los puertos de acceso tienen PortFast habilitado, esto garantiza que **no se cree accidentalmente un bucle** si se agrega un switch no autorizado a la topología.

BPDU Guard se habilita **globalmente en todos los puertos STP PortFast** con el comando **`spanning-tree portfast bpduguard default`**. BPDU Guard puede **habilitarse o deshabilitarse por interfaz** con el comando **`spanning-tree bpduguard {enable | disable}`**.

El **Ejemplo 3-11** muestra cómo configurar **BPDU Guard globalmente** en **SW1** para todos los puertos de acceso, con la **excepción** de deshabilitar BPDU Guard en **Gi1/0/8**. El comando **`show spanning-tree interface interface-id detail`** muestra si BPDU Guard está habilitado para el puerto especificado.

**Ejemplo 3-11:** Configuración de BPDU Guard
```plaintext
SW1# configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
SW1(config)# spanning-tree portfast bpduguard default
SW1(config)# interface gi1/0/8
SW1(config-if)# spanning-tree bpduguard disable
```

```plaintext
SW1# show spanning-tree interface gi1/0/7 detail
Port 7 (GigabitEthernet1/0/7) of VLAN0010 is designated forwarding
Port path cost 4, Port priority 128, Port Identifier 128.7
Designated root has priority 32778, address 0062.ec9d.c500
Designated bridge has priority 32778, address 0062.ec9d.c500
Designated port id is 128.7, designated path cost 0
Timers: message age 0, forward delay 0, hold 0
Number of transitions to forwarding state: 1
The port is in the portfast mode
Link type is point-to-point by default
Bpdu guard is enabled by default
BPDU: sent 23386, received 0
```

```plaintext
SW1# show spanning-tree interface gi1/0/8 detail
Port 8 (GigabitEthernet1/0/8) of VLAN0010 is designated forwarding
Port path cost 4, Port priority 128, Port Identifier 128.8
Designated root has priority 32778, address 0062.ec9d.c500
Designated bridge has priority 32778, address 0062.ec9d.c500
Designated port id is 128.8, designated path cost 0
Timers: message age 0, forward delay 0, hold 0
Number of transitions to forwarding state: 1
The port is in the portfast mode
Link type is point-to-point by default
BPDU: sent 23388, received 0
```

> **NOTA**  BPDU Guard normalmente se configura en **todos los puertos orientados a hosts** que tienen **PortFast** habilitado.

El **Ejemplo 3-12** muestra los **mensajes syslog** que aparecen cuando se recibe una **BPDU** en un **puerto con BPDU Guard habilitado**. El puerto se coloca en **estado errDisabled**, como se muestra con el comando **`show interfaces status`**.

**Ejemplo 3-12:** Detección de una BPDU en un puerto con BPDU Guard habilitado
```plaintext
12:47:02.069: %SPANTREE-2-BLOCK_BPDUGUARD: Received BPDU on port GigabitEthernet1/0/2 with BPDU Guard enabled. Disabling port.
12:47:02.076: %PM-4-ERR_DISABLE: bpduguard error detected on Gi1/0/2, putting Gi1/0/2 in err-disable state
12:47:03.079: %LINK-3-UPDOWN: Line protocol on Interface GigabitEthernet1/0/2, changed state to down
12:47:04.082: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/2, changed state to down
```

```plaintext
SW1# show interfaces status

Port     Name        Status      Vlan  Duplex Speed Type
Gi1/0/1              notconnect  1     auto   auto  10/100/1000BaseTX
Gi1/0/2   SW2 Gi1/0/1 err-disabled 1    auto   auto  10/100/1000BaseTX
Gi1/0/3   SW3 Gi1/0/1 connected   trunk a-full a-1000 10/100/1000BaseTX
```

De forma predeterminada, los puertos que se colocan en **estado errDisabled** debido a **BPDU Guard** **no se recuperan automáticamente**. El **servicio de Error Recovery** puede usarse para reactivar puertos que fueron apagados por un problema específico, reduciendo la sobrecarga administrativa. Para usar **Error Recovery** para recuperar puertos que fueron deshabilitados por BPDU Guard, use el comando **`errdisable recovery cause bpduguard`**. El intervalo con el que **Error Recovery** revisa los puertos se configura con el comando **`errdisable recovery interval time-seconds`**.

El **Ejemplo 3-13** demuestra la **configuración del servicio Error Recovery para BPDU Guard**, la **verificación** del servicio y los **mensajes syslog** correspondientes.

**Ejemplo 3-13:** Configuración del servicio Error Recovery
```plaintext
SW1# configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
SW1(config)# errdisable recovery cause bpduguard
```

```plaintext
SW1# show errdisable recovery
Output omitted for brevity

ErrDisable Reason        Timer Status
----------------        ------------
arp-inspection          Disabled
bpduguard               Enabled

Recovery command: clear  Disabled
Timer interval: 300 seconds

Interfaces that will be enabled at the next timeout:

Interface   Errdisable reason   Time left(sec)
---------   -----------------   -------------
Gi1/0/2     bpduguard            295
```

```plaintext
! Salida de syslog de la recuperación por BPDU.
! El puerto será recuperado y luego volverá a dispararse
! porque el puerto sigue recibiendo BPDUs.
SW1#
01:02:08.122: %PM-4-ERR_RECOVER: Attempting to recover from bpduguard err-disable state on Gi1/0/2
01:02:10.699: %SPANTREE-2-BLOCK_BPDUGUARD: Received BPDU on port GigabitEthernet1/0/2 with BPDU Guard enabled. Disabling port.
01:02:10.699: %PM-4-ERR_DISABLE: bpduguard error detected on Gi1/0/2, putting Gi1/0/2 in err-disable state
```

> **NOTA**  El servicio **Error Recovery** se ejecuta cada **300 segundos (5 minutos)**. Este valor puede cambiarse a un rango de **30 a 86.400 segundos** con el comando de configuración global **`errdisable recovery interval time`**.

**BPDU Filter**

**BPDU Filter** simplemente bloquea que las **BPDUs** se transmitan por un puerto. BPDU Filter puede habilitarse **globalmente** o en una **interfaz específica**.  
La configuración global de BPDU Filter utiliza el comando **`spanning-tree portfast bpdufilter default`**. El BPDU Filter específico por interfaz se habilita con el comando **`spanning-tree bpdufilter enable`**.

Si BPDU Filter está habilitado en un puerto con **PortFast**, el comportamiento cambia según la configuración:

- Si BPDU Filter está habilitado **globalmente**, el puerto envía una serie de **10 a 12 BPDUs** en un puerto con PortFast habilitado. Si el switch recibe alguna BPDU, verifica para identificar **qué switch es el preferido**.
    
- El **switch preferido** no procesa las BPDUs que recibe, pero **sí transmite BPDUs** a switches aguas abajo inferiores.
    
- Un **switch no preferido** procesa las BPDUs recibidas desde un switch superior, pero **no transmite BPDUs** hacia el switch superior.
    
- Si BPDU Filter está habilitado en un **puerto específico con PortFast**, el puerto **no envía ninguna BPDU de forma continua**. Si el puerto remoto recibe una BPDU, generalmente **coloca el puerto en estado errDisabled** como mecanismo de **prevención de bucles**.

> **NOTA**  Ten cuidado al implementar **BPDU Filter**, ya que puede causar problemas. La mayoría de los diseños de red **no requieren BPDU Filter**, el cual añade un **nivel innecesario de complejidad** y además **introduce riesgo**.

El **Ejemplo 3-14** muestra las **estadísticas de SW1 Gi1/0/2** después de habilitar BPDU Filter en la **interfaz Gi1/0/2**. En el primer conjunto de salidas, BPDU Filter está habilitado **específicamente** en Gi1/0/2 (impidiendo que se envíen o reciban BPDUs). El segundo conjunto de salidas habilita BPDU Filter **globalmente**, lo que provoca que se transmitan BPDUs cuando el puerto se activa por primera vez; el filtrado se verifica por el **cambio en el número de BPDUs enviadas de 56 a 58**.

**Ejemplo 3-14:** Verificación de BPDU Filter
```plaintext
! SW1 tenía BPDU Filter habilitado solo en el puerto Gi1/0/2
SW1# show spanning-tree interface gi1/0/2 detail | in BPDU|Bpdu|Ethernet
Port 2 (GigabitEthernet1/0/2) of VLAN0001 is designated forwarding
Bpdu filter is enabled
BPDU: sent 113, received 84
```

```plaintext
! SW2 tenía BPDU Filter habilitado globalmente
SW2# show spanning-tree interface gi1/0/2 detail | in BPDU|Bpdu|Ethernet
Port 1 (GigabitEthernet1/0/2) of VLAN0001 is designated forwarding
BPDU: sent 56, received 5
```

**Problemas con enlaces unidireccionales**

Los **cables de fibra óptica** constan de hilos de vidrio/plástico que transmiten luz. Un cable normalmente incluye **un hilo para transmitir** datos y **otro para recibir** datos en cada extremo; el orden es **directamente opuesto** en el lado remoto. Los dispositivos de red que usan fibra pueden encontrarse con **flujos unidireccionales** si uno de los hilos se rompe. En estos escenarios, la interfaz **sigue mostrando estado de enlace**; sin embargo, **las BPDUs no pueden transmitirse**, y el switch aguas abajo **se agota** con el puerto raíz existente e identifica **un puerto diferente como root port**. El tráfico se recibe entonces en el nuevo root port y se reenvía por el hilo que aún funciona, creando **un bucle de forwarding**.

Un par de soluciones puede resolver este escenario:

- **STP Loop Guard**
    
- **Detección de Enlaces Unidireccionales (UDLD)**

**STP Loop Guard**

**STP Loop Guard** evita que **puertos alternos o puertos raíz** se conviertan en **puertos designados** (puertos hacia switches aguas abajo) **debido a la pérdida de BPDUs en el puerto raíz**. Loop Guard coloca el puerto original en un **estado inconsistente de bucle** mientras no se reciban BPDUs. Cuando la transmisión de BPDUs se reanuda en esa interfaz, el puerto **se recupera** y **vuelve a transitar por los estados de STP**.

Loop Guard se habilita **globalmente** con el comando **`spanning-tree loopguard default`**, o puede habilitarse **por interfaz** con el comando **`spanning-tree guard loop`**. Es importante notar que **Loop Guard no debe habilitarse en puertos con PortFast**, ya que **entra en conflicto directo con la lógica de puertos root/alternate**.

El **Ejemplo 3-15** demuestra la configuración de **Loop Guard** en el puerto **SW2 Gi1/0/1**.

**Ejemplo 3-15:** Configuración de Loop Guard
```plaintext
SW2# config t
SW2(config)# interface gi1/0/1
SW2(config-if)# spanning-tree guard loop
! Colocar BPDU filter en el RP de SW2 (Gi1/0/1) dispara Loop Guard.
SW2(config-if)# interface gi1/0/1
SW2(config-if)# spanning-tree bpdufilter enable
01:42:35.051: %SPANTREE-2-LOOPGUARD_BLOCK: Loop guard blocking port GigabitEthernet1/0/1 on VLAN0010
```

```plaintext
SW2# show spanning-tree vlan 1 | b Interface

Interface        Role Sts Cost  Prio.Nbr Type
--------------------------------------------
Gi1/0/1          Root BLK 4     128.1    P2p *LOOP_Inc
Gi1/0/3          Root FWD 4     128.3    P2p
Gi1/0/4          Desg FWD 4     128.4    P2p
```

En este punto, el puerto se considera en un **estado inconsistente** y **no reenvía tráfico**. Los puertos inconsistentes se visualizan con el comando **`show spanning-tree inconsistentports`**, como se muestra en el **Ejemplo 3-16**. Obsérvese que **existe una entrada para todas las VLANs** transportadas por **Gi1/0/1**.

**Ejemplo 3-16:** Visualización de puertos STP inconsistentes
```plaintext
SW2# show spanning-tree inconsistentports

Name        Interface              Inconsistency
-----------------------------------------------
VLAN0001    GigabitEthernet1/0/1   Loop Inconsistent
VLAN0010    GigabitEthernet1/0/1   Loop Inconsistent
VLAN0020    GigabitEthernet1/0/1   Loop Inconsistent
VLAN0099    GigabitEthernet1/0/1   Loop Inconsistent

Number of inconsistent ports (segments) in the system: 4
```

**Detección de Enlaces Unidireccionales**

**Unidirectional Link Detection (UDLD)** permite la **monitorización bidireccional** de cables de **fibra óptica**. UDLD funciona transmitiendo **paquetes UDLD** a un dispositivo vecino que incluyen el **ID del sistema** y el **ID del puerto** de la interfaz que envía el paquete UDLD. El dispositivo receptor **devuelve esta información**, incluyendo su **ID de sistema** y **ID de puerto**, al dispositivo de origen. Este proceso continúa de forma indefinida. UDLD opera en **dos modos distintos**:

- **Normal:** En modo normal, si una trama no es reconocida, el enlace se considera **indeterminado** y el puerto **permanece activo**.
    
- **Agresivo:** En modo agresivo, cuando una trama no es reconocida, el switch envía **paquetes adicionales en intervalos de 1 segundo**. Si esos paquetes no son reconocidos, el puerto se coloca en un **estado de error**.
    

UDLD se habilita **globalmente** con el comando **`udld enable [aggressive]`**. Este comando habilita UDLD en **todos los puertos SFP**. UDLD puede **deshabilitarse en un puerto específico** con el comando de configuración de interfaz **`udld port disable`**.

La **recuperación de UDLD** puede habilitarse con el comando **`udld recovery [interval time]`**, donde la palabra clave opcional **interval** permite modificar el temporizador desde el valor predeterminado de **5 minutos**. UDLD también puede habilitarse **por puerto** con el comando de configuración de interfaz **`udld port [aggressive]`**, donde la palabra clave opcional **aggressive** coloca los puertos en **modo agresivo**.

El **Ejemplo 3-17** muestra cómo habilitar **UDLD en modo normal** en **SW1**.

**Ejemplo 3-17:** Configuración de UDLD
```plaintext
SW1# conf t
SW1(config)# udld enable
```

UDLD también debe habilitarse en el **switch remoto**. Después de configurarlo, el **estado de vecindad UDLD** puede verificarse con el comando **`show udld neighbors`**. Se puede ver información más detallada con el comando **`show udld interface-id`**.

El **Ejemplo 3-18** muestra la verificación de la **vecindad de SW1 con SW2**. El enlace está operando en **estado bidireccional**. Se obtiene información adicional con el comando **`show udld gi1/1/3`**, que incluye el **estado actual**, los **IDs de los dispositivos** (es decir, números de serie), los **IDs de las interfaces de origen** y los **IDs de las interfaces de retorno**.

**Ejemplo 3-18:** Verificación de vecinos UDLD y estado del puerto del switch
```plaintext
SW1# show udld neighbors

Port      Device Name  Device ID   Port ID   Neighbor State
----      -----------  ---------   -------   --------------
Te1/1/3   081C4FFB80   1           Te1/1/3   Bidirectional
```

```plaintext
SW1# show udld Te1/1/3

Interface Te1/1/3
Port enable administrative configuration setting: Follows device default 
Port enable operational state: Enabled 
Current bidirectional state: Bidirectional 
Current operational state: Advertisement - Single neighbor detected 
Message interval: 15000 ms 
Time out interval: 5000 ms 

Port fast-hello configuration setting: Disabled 
Port fast-hello interval: 0 ms 
Port fast-hello operational state: Disabled 
Neighbor fast-hello configuration setting: Disabled 
Neighbor fast-hello interval: Unknown 

   Entry 1 
   --- 
   Expiration time: 41300 ms 
   Cache Device index: 1 
   Current neighbor state: Bidirectional 
   Device ID: 081C4FF8B0 
   Port ID: Te1/1/3 
   Neighbor echo 1 device: 062EC9DC50 
   Neighbor echo 1 port: Te1/1/3 

   TLV Message interval: 15 sec 
   No TLV fast-hello interval 
   TLV Time out interval: 5 
   TLV CDP Device name: SW2
```

